docs/posts/2015-02-18-ash-wednesday-prayer.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 14, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ash Wednesday Prayer</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Ash Wednesday Prayer</h1>
<p class="subtitle" role="doc-subtitle">Feb 18, 2015</p>
</header><p>
Lord, have mercy,<br>
for I have heard the gentle voice of God,<br>
yet speak to others with words that hurt and destroy.
</p>

<p>
Lord, have mercy,<br>
for I have been given more than I could ever use,<br>
yet refuse to see the needs of those around me.
</p>

<p>
Lord, have mercy,<br>
for you have placed me in positions of power and influence,<br>
yet I use those positions for my own gain, and not in service to your children.
</p>

<p>
Lord, have mercy,<br>
for you have placed me as your steward on this earth,<br>
yet I continue to harm your creation by the choices that I make.
</p>

<p>
Lord, have mercy,<br>
for every breath I take is a gift from you,<br>
yet I focus only on the few meaningless things that I lack.
</p>

<p>
Lord, have mercy,<br>
for I have experienced the power of the Resurrection,<br>
yet my thoughts are often as one who has no hope.
</p>

<p>
Lord, have mercy,<br>
for I have have been set free by the Cross,<br>
yet live as one who is still in bondage.
</p>

<p>
Lord, have mercy on me, a sinner.<br>
</p>

<p>
We who are your children,<br>
in humility and penitence,<br>
now seek your face.
</p>

<p>
Lord, have mercy.
</p>

<p>
<i>Amen</i>
</p>

<blockquote>
<p>
Much more surely then, now that we have been justified by his blood, will we be saved through him from the wrath of God. For if while we were enemies, we were reconciled to God through the death of his Son, much more surely, having been reconciled, will we be saved by his life. But more than that, we even boast in God through our Lord Jesus Christ, through whom we have now received reconciliation.
</p>
</blockquote>

<p>
Romans 5:9-11 (NRSV)
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 14, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
